Tester/src/Catalogs/Scenarios/Scenarios.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scenarios</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Access</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Application</name>
    <type>
      <types>CatalogRef.Applications</types>
    </type>
  </attributes>
  <attributes>
    <name>Changed</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>LastCreator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Path</name>
    <type>
      <types>DefinedType.ScenarioPath</types>
    </type>
  </attributes>
  <attributes>
    <name>Script</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Severity</name>
    <type>
      <types>EnumRef.Severity</types>
    </type>
  </attributes>
  <attributes>
    <name>Sorting</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Spreadsheet</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Tag</name>
    <type>
      <types>CatalogRef.TagKeys</types>
    </type>
  </attributes>
  <attributes>
    <name>Template</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Tree</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Type</name>
    <type>
      <types>EnumRef.Scenarios</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Areas</name>
    <attributes>
      <name>Name</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Top</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Left</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Bottom</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Right</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Users</name>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Users</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Tester/src/Catalogs/Scenarios/Forms/ChangeApplication/Module.bsl
&AtServer
var AllScenarios export;
&AtServer
var WorkingScope export;

// *****************************************
// *********** Form events

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	LockingForm.LoadScenarios ( ThisObject );
	
EndProcedure

// *****************************************
// *********** Group Form

&AtClient
Procedure OK ( Command )
	
	var changed, locked, alreadyLocked, errors;
	
	change ( changed, locked, alreadyLocked, errors );
	broadcast ( changed );
	RepositoryFiles.Sync ();
	Close ( new Structure ( "AlreadyLocked, Errors", alreadyLocked, errors ) );
	
EndProcedure

&AtServer
Procedure change ( Changed, Locked, AlreadyLocked, Errors )
	
	fetchScenarios ();
	LockingForm.Lock ( AllScenarios, Locked, AlreadyLocked );
	modify ( AlreadyLocked, Errors );
	Changed = WorkingScope;
	
EndProcedure

&AtServer
Procedure fetchScenarios ()
	
	data = LockingForm.FetchScenarios ( ThisObject );
	AllScenarios = data [ 0 ].Unload ();
	WorkingScope = data [ 1 ].Unload ().UnloadColumn ( "Ref" );
	
EndProcedure 

&AtServer
Procedure modify ( AlreadyLocked, Errors )
	
	errorsList = new Array ();
	notMine = notMine ( AlreadyLocked );
	for each row in AllScenarios do
		scenario = row.Ref;
		if ( notMine [ scenario ] <> undefined ) then
			continue;
		endif; 
		current = DF.Pick ( scenario, "Application" );
		if ( current = Application ) then
			continue;
		endif;
		obj = scenario.GetObject ();
		obj.Application = Application;
		try
			obj.Write ();
		except
			error = ErrorDescription ();
			errorsList.Add ( new Structure ( "Scenario, Error", scenario, error ) );
			continue;
		endtry;
	enddo; 
	Errors = ? ( errorsList.Count () = 0, undefined, errorsList );
	
EndProcedure

&AtServer
Function notMine ( AlreadyLocked )
	
	set = new Map ();
	if ( AlreadyLocked <> undefined ) then
		for each item in AlreadyLocked do
			set [ item.Scenario ] = true;
		enddo; 
	endif; 
	return set;
	
EndFunction 

&AtClient
Procedure broadcast ( Changed )
	
	Notify ( Enum.MessageApplicationChanged (), Changed );
	NotifyChanged ( Type ( "CatalogRef.Scenarios" ) );
	
EndProcedure 

// *****************************************
// *********** Table List

&AtClient
Procedure ListBeforeAddRow ( Item, Cancel, Clone, Parent, Folder, Parameter )
	
	Cancel = true;
	
EndProcedure

&AtClient
Procedure ListBeforeDeleteRow ( Item, Cancel )
	
	Cancel = true;
	
EndProcedure
